In [1]:
import pandas as pd
import numpy as np

<h1>Series</h1>

In [4]:
labels = ['a', 'b', 'c']

minha_lista = [10,20,30]

arr = np.array([10,20,30])

d = {'a':10, 'b':20, 'c':30}

In [5]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [6]:
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: object

In [8]:
pd.Series(labels, minha_lista)

10    a
20    b
30    c
dtype: object

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
ser1 = pd.Series([1,2,3,4], index=['EUA','Alemanha','USSR','Japão'])

In [11]:
ser1

EUA         1
Alemanha    2
USSR        3
Japão       4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,3,4], index=['Ghana','Alemanha','USSR','Japão'])

In [13]:
ser2

Ghana       1
Alemanha    2
USSR        3
Japão       4
dtype: int64

In [17]:
ser1[['USSR', 'EUA']]

USSR    3
EUA     1
dtype: int64

In [18]:
ser1 + ser2

Alemanha    4.0
EUA         NaN
Ghana       NaN
Japão       8.0
USSR        6.0
dtype: float64

<h1>DataFrames</h1>

In [20]:
from numpy.random import randn

In [22]:
df = pd.DataFrame(randn(5,4), index=["A","B","C","D","E"], columns="W X Y Z".split())

In [23]:
df

          W         X         Y         Z
A  0.044063 -0.235201 -0.564206 -0.031490
B -0.251298  2.058784  0.161504 -0.730824
C -2.433519  1.490309  0.067625  0.217894
D  0.531368 -0.683324  0.906502 -1.847637
E -0.252739 -0.140919  0.646393 -0.419765

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df

          W         X         Y         Z
A  0.044063 -0.235201 -0.564206 -0.031490
B -0.251298  2.058784  0.161504 -0.730824
C -2.433519  1.490309  0.067625  0.217894
D  0.531368 -0.683324  0.906502 -1.847637
E -0.252739 -0.140919  0.646393 -0.419765

In [26]:
df['W']

A    0.044063
B   -0.251298
C   -2.433519
D    0.531368
E   -0.252739
Name: W, dtype: float64

<h3>Serie seleciona o índice já o DataFrame especifica a coluna</h3>

In [27]:
type(df['W'])

pandas.core.series.Series

In [28]:
df[['W','Y']]

          W         Y
A  0.044063 -0.564206
B -0.251298  0.161504
C -2.433519  0.067625
D  0.531368  0.906502
E -0.252739  0.646393

In [29]:
df[['W']]

          W
A  0.044063
B -0.251298
C -2.433519
D  0.531368
E -0.252739

In [30]:
df["new"] = df["W"]

In [31]:
df

          W         X         Y         Z       new
A  0.044063 -0.235201 -0.564206 -0.031490  0.044063
B -0.251298  2.058784  0.161504 -0.730824 -0.251298
C -2.433519  1.490309  0.067625  0.217894 -2.433519
D  0.531368 -0.683324  0.906502 -1.847637  0.531368
E -0.252739 -0.140919  0.646393 -0.419765 -0.252739

In [32]:
df["new"] = df["W"] + df["Y"]

In [33]:
df

          W         X         Y         Z       new
A  0.044063 -0.235201 -0.564206 -0.031490 -0.520143
B -0.251298  2.058784  0.161504 -0.730824 -0.089794
C -2.433519  1.490309  0.067625  0.217894 -2.365893
D  0.531368 -0.683324  0.906502 -1.847637  1.437870
E -0.252739 -0.140919  0.646393 -0.419765  0.393654

In [34]:
df.drop("new", axis=1)

          W         X         Y         Z
A  0.044063 -0.235201 -0.564206 -0.031490
B -0.251298  2.058784  0.161504 -0.730824
C -2.433519  1.490309  0.067625  0.217894
D  0.531368 -0.683324  0.906502 -1.847637
E -0.252739 -0.140919  0.646393 -0.419765

In [35]:
df

          W         X         Y         Z       new
A  0.044063 -0.235201 -0.564206 -0.031490 -0.520143
B -0.251298  2.058784  0.161504 -0.730824 -0.089794
C -2.433519  1.490309  0.067625  0.217894 -2.365893
D  0.531368 -0.683324  0.906502 -1.847637  1.437870
E -0.252739 -0.140919  0.646393 -0.419765  0.393654

In [36]:
df.drop("new", axis=1, inplace=True)

In [37]:
df

          W         X         Y         Z
A  0.044063 -0.235201 -0.564206 -0.031490
B -0.251298  2.058784  0.161504 -0.730824
C -2.433519  1.490309  0.067625  0.217894
D  0.531368 -0.683324  0.906502 -1.847637
E -0.252739 -0.140919  0.646393 -0.419765

<h1>Iloc e filtros - Seleções em DataFrames</h1>

In [38]:
df.loc['A']

W    0.044063
X   -0.235201
Y   -0.564206
Z   -0.031490
Name: A, dtype: float64

In [41]:
df.loc[['A','B']]

          W         X         Y         Z
A  0.044063 -0.235201 -0.564206 -0.031490
B -0.251298  2.058784  0.161504 -0.730824

In [42]:
df.iloc[0,2]

-0.5642056875314049

In [44]:
df.loc[['A','B'], ['W']]

          W
A  0.044063
B -0.251298

In [45]:
df

          W         X         Y         Z
A  0.044063 -0.235201 -0.564206 -0.031490
B -0.251298  2.058784  0.161504 -0.730824
C -2.433519  1.490309  0.067625  0.217894
D  0.531368 -0.683324  0.906502 -1.847637
E -0.252739 -0.140919  0.646393 -0.419765

In [50]:
df.iloc[:-1,1:4]

          X         Y         Z
A -0.235201 -0.564206 -0.031490
B  2.058784  0.161504 -0.730824
C  1.490309  0.067625  0.217894
D -0.683324  0.906502 -1.847637

In [51]:
df.iloc[1:4,1:3]

          X         Y
B  2.058784  0.161504
C  1.490309  0.067625
D -0.683324  0.906502

In [54]:
df

          W         X         Y         Z
A  0.044063 -0.235201 -0.564206 -0.031490
B -0.251298  2.058784  0.161504 -0.730824
C -2.433519  1.490309  0.067625  0.217894
D  0.531368 -0.683324  0.906502 -1.847637
E -0.252739 -0.140919  0.646393 -0.419765

In [55]:
df[df > 0]

          W         X         Y         Z
A  0.044063       NaN       NaN       NaN
B       NaN  2.058784  0.161504       NaN
C       NaN  1.490309  0.067625  0.217894
D  0.531368       NaN  0.906502       NaN
E       NaN       NaN  0.646393       NaN

In [56]:
df["Y"] > 0

A    False
B     True
C     True
D     True
E     True
Name: Y, dtype: bool

In [58]:
df[df["Y"]>0]

          W         X         Y         Z
B -0.251298  2.058784  0.161504 -0.730824
C -2.433519  1.490309  0.067625  0.217894
D  0.531368 -0.683324  0.906502 -1.847637
E -0.252739 -0.140919  0.646393 -0.419765

In [64]:
df[(df["Y"]>0) & (df["W"]>0)]

          W         X         Y         Z
D  0.531368 -0.683324  0.906502 -1.847637

# Operaçõs com índice

In [66]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [67]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [70]:
df.reset_index(inplace = True)

In [71]:
df

  index         W         X         Y         Z
0     A  0.044063 -0.235201 -0.564206 -0.031490
1     B -0.251298  2.058784  0.161504 -0.730824
2     C -2.433519  1.490309  0.067625  0.217894
3     D  0.531368 -0.683324  0.906502 -1.847637
4     E -0.252739 -0.140919  0.646393 -0.419765

In [73]:
df.set_index("index",inplace = True)

In [74]:
df

              W         X         Y         Z
index
A      0.044063 -0.235201 -0.564206 -0.031490
B     -0.251298  2.058784  0.161504 -0.730824
C     -2.433519  1.490309  0.067625  0.217894
D      0.531368 -0.683324  0.906502 -1.847637
E     -0.252739 -0.140919  0.646393 -0.419765

In [75]:
novoind = "CA NY WY OR CO".split()

In [76]:
df["novo_index"] = novoind

In [77]:
df.set_index("novo_index")

                   W         X         Y         Z
novo_index
CA          0.044063 -0.235201 -0.564206 -0.031490
NY         -0.251298  2.058784  0.161504 -0.730824
WY         -2.433519  1.490309  0.067625  0.217894
OR          0.531368 -0.683324  0.906502 -1.847637
CO         -0.252739 -0.140919  0.646393 -0.419765

In [78]:
df.reset_index().set_index("novo_index")

           index         W         X         Y         Z
novo_index
CA             A  0.044063 -0.235201 -0.564206 -0.031490
NY             B -0.251298  2.058784  0.161504 -0.730824
WY             C -2.433519  1.490309  0.067625  0.217894
OR             D  0.531368 -0.683324  0.906502 -1.847637
CO             E -0.252739 -0.140919  0.646393 -0.419765

# Hierarquia de índices e índices múltiplos

In [81]:
# Níveis de Índice
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]

hier_index = list(zip(outside,inside))

In [82]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [83]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [84]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [86]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=["A","B"])
df

             A         B
G1 1  0.888358  1.010453
   2 -0.839673 -1.531804
   3 -1.358154 -0.441317
G2 1 -1.198157 -0.054874
   2  0.516456 -2.390535
   3  0.716703 -1.312462

In [87]:
df.loc["G1"]

          A         B
1  0.888358  1.010453
2 -0.839673 -1.531804
3 -1.358154 -0.441317

In [88]:
df.loc["G1"].loc[1]

A    0.888358
B    1.010453
Name: 1, dtype: float64

In [91]:
df.index.names = ['Grupo', 'Numero']

In [92]:
df

                     A         B
Grupo Numero
G1    1       0.888358  1.010453
      2      -0.839673 -1.531804
      3      -1.358154 -0.441317
G2    1      -1.198157 -0.054874
      2       0.516456 -2.390535
      3       0.716703 -1.312462

In [96]:
df.xs("G1")

               A         B
Numero
1       0.888358  1.010453
2      -0.839673 -1.531804
3      -1.358154 -0.441317

In [95]:
df.xs(1, level="Numero")

              A         B
Grupo
G1     0.888358  1.010453
G2    -1.198157 -0.054874

# Tratamento de dados ausentes

In [97]:
df = pd.DataFrame ({'A': [1,2,np.nan],
                    'B': [5,np.nan,np.nan],
                    'C': [1,2,3]})

In [98]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [102]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [103]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [104]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [105]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [106]:
df.fillna("Nada")

      A     B  C
0   1.0   5.0  1
1   2.0  Nada  2
2  Nada  Nada  3

In [107]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [108]:
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [109]:
df.bfill()

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# Groupby

In [122]:
data = {'Classe':['Júnior','Júnior','Pleno','Pleno','Sênior','Sênior'],
        'Nome':['Jorge','Carlos','Roberta','Patrícia','Bruno','Vera'],
        'Venda':[200,120,340,124,243,450]}

In [123]:
data

{'Classe': ['Júnior', 'Júnior', 'Pleno', 'Pleno', 'Sênior', 'Sênior'],
 'Nome': ['Jorge', 'Carlos', 'Roberta', 'Patrícia', 'Bruno', 'Vera'],
 'Venda': [200, 120, 340, 124, 243, 450]}

In [136]:
df = pd.DataFrame(data)

In [125]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    450

In [126]:
df.groupby("Classe")

In [127]:
group = df.groupby('Classe')
group.sum()

/tmp/ipykernel_9052/726546120.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group.sum()

        Venda
Classe
Júnior    320
Pleno     464
Sênior    693

In [128]:
group.mean()

/tmp/ipykernel_9052/3928442431.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group.mean()

        Venda
Classe
Júnior  160.0
Pleno   232.0
Sênior  346.5

In [129]:
df.groupby("Classe").sum()

/tmp/ipykernel_9052/4043718333.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Classe").sum()

        Venda
Classe
Júnior    320
Pleno     464
Sênior    693

In [130]:
df.groupby("Classe").min()

            Nome  Venda
Classe
Júnior    Carlos    120
Pleno   Patrícia    124
Sênior     Bruno    243

In [131]:
df.groupby("Classe").max()

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior     Vera    450

In [138]:
df2 = df.copy()

In [140]:
df2["Venda"] = [150,432,190,230,410,155]

In [142]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    450

In [141]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [143]:
df3 = pd.concat([df, df2])

In [144]:
df3

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    450
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [145]:
df3.groupby(["Classe", "Nome"]).sum()

                 Venda
Classe Nome
Júnior Carlos      552
       Jorge       350
Pleno  Patrícia    354
       Roberta     530
Sênior Bruno       653
       Vera        605

# Merge, concat e Join

In [149]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                   index=[0,1,2,3])

In [148]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                    'D':['D4','D5','D6','D7']},
                   index=[4,5,6,7])

In [150]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                    'D':['D8','D9','D10','D11']},
                   index=[8,9,10,11])

In [151]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [152]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [153]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [154]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [156]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [157]:
esquerda = pd.DataFrame({'key':['K0','K1','K2','K3'],
                        'A':['A0','A1','A2','A3'],
                        'B':['B0','B1','B2','B3']})

direita = pd.DataFrame({'key':['K0','K1','K2','K3'],
                        'A':['C0','C1','C2','C3'],
                        'B':['D0','D1','D2','D3']})

In [158]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [159]:
direita

  key   A   B
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [164]:
pd.merge(esquerda, direita, on="key")

  key A_x B_x A_y B_y
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [165]:
esquerda = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                         'key2':['K0','K1','K0','K1'],
                        'A':['A0','A1','A2','A3'],
                        'B':['B0','B1','B2','B3']})

direita = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                        'key2':['K0','K0','K0','K0'],
                        'A':['C0','C1','C2','C3'],
                        'B':['D0','D1','D2','D3']})

In [166]:
esquerda

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [167]:
direita

  key1 key2   A   B
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [171]:
pd.merge(esquerda, direita, on=["key1", 'key2'])

  key1 key2 A_x B_x A_y B_y
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [173]:
pd.merge(esquerda, direita, how="outer" ,on=["key1", 'key2'])

  key1 key2  A_x  B_x  A_y  B_y
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [174]:
pd.merge(esquerda, direita, how="right" ,on=["key1", 'key2'])

  key1 key2  A_x  B_x A_y B_y
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [175]:
pd.merge(esquerda, direita, how="left" ,on=["key1", 'key2'])

  key1 key2 A_x B_x  A_y  B_y
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [177]:
esquerda = pd.DataFrame({'A':['A0','A1','A2'],
                         'B':['B0','B1','B2']},
                         index = ['K0','K1','K2'])

direita = pd.DataFrame({'C':['C0','C2','C3'],
                         'D':['D0','D1','D3']},
                         index = ['K0','K1','K3'])

In [178]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C2   D1
K2  A2  B2  NaN  NaN

In [179]:
esquerda.join(direita, how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1   C2   D1
K2   A2   B2  NaN  NaN
K3  NaN  NaN   C3   D3

In [180]:
esquerda.join(direita, how="right")

      A    B   C   D
K0   A0   B0  C0  D0
K1   A1   B1  C2  D1
K3  NaN  NaN  C3  D3

In [181]:
esquerda.join(direita, how="left")

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C2   D1
K2  A2  B2  NaN  NaN

# Operações com DataFrames

In [191]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [192]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [193]:
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

<h3>INformações sobre valores exclusivos</h3>

In [194]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [195]:
df["col2"].unique()

array([444, 555, 666])

In [196]:
df["col2"].nunique()

3

In [197]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

<h3>Aplicando funções</h3>

In [198]:
def comp(x):
    return x **2 + 3

In [200]:
df['col1'].apply(comp)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [201]:
df['col1_calc'] = df['col1'].apply(comp)

In [202]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [203]:
df['col1'].apply(lambda x: x **2 + 3)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [204]:
df['col1'].sum()

10

In [205]:
df['col1'].mean()

2.5

In [206]:
df['col1'].product()

24

In [207]:
df['col1'].std()

1.2909944487358056

In [208]:
df['col1'].max()

4

In [209]:
df['col1'].min()

1

In [211]:
df['col1'].idxmax()

3

In [214]:
df[df['col2'] == 444]

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19

In [213]:
df[df['col2'] == 444]['col1'].sum()

5

In [216]:
df.sort_values(by='col2')

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19
1     2   555  def          7
2     3   666  ghi         12

# Dados temporais

In [217]:
numero_de_dias = 100

In [221]:
datas = pd.date_range(start='1/1/2021', periods=numero_de_dias)
datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[ns]', freq='D')

In [226]:
df = pd.DataFrame(range(numero_de_dias), columns=['numbers'], index = datas)

In [227]:
df

            numbers
2021-01-01        0
2021-01-02        1
2021-01-03        2
2021-01-04        3
2021-01-05        4
...             ...
2021-04-06       95
2021-04-07       96
2021-04-08       97
2021-04-09       98
2021-04-10       99

[100 rows x 1 columns]

In [228]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[ns]', freq='D')

In [229]:
df.index[0]

Timestamp('2021-01-01 00:00:00', freq='D')

In [230]:
df.index[0].day

1

In [231]:
df.index[0].month

1

In [232]:
df.index[0].year

2021

In [233]:
df.index[0].hour

0

In [234]:
df[df.index.month == 1]

            numbers
2021-01-01        0
2021-01-02        1
2021-01-03        2
2021-01-04        3
2021-01-05        4
2021-01-06        5
2021-01-07        6
2021-01-08        7
2021-01-09        8
2021-01-10        9
2021-01-11       10
2021-01-12       11
2021-01-13       12
2021-01-14       13
2021-01-15       14
2021-01-16       15
2021-01-17       16
2021-01-18       17
2021-01-19       18
2021-01-20       19
2021-01-21       20
2021-01-22       21
2021-01-23       22
2021-01-24       23
2021-01-25       24
2021-01-26       25
2021-01-27       26
2021-01-28       27
2021-01-29       28
2021-01-30       29
2021-01-31       30

In [235]:
df[df.index.day == 10]

            numbers
2021-01-10        9
2021-02-10       40
2021-03-10       68
2021-04-10       99

In [236]:
df['Month'] = df.index.month

In [237]:
import datetime

In [240]:
df[df.index > datetime.datetime(2021, 1, 10)]

            numbers  Month
2021-01-11       10      1
2021-01-12       11      1
2021-01-13       12      1
2021-01-14       13      1
2021-01-15       14      1
...             ...    ...
2021-04-06       95      4
2021-04-07       96      4
2021-04-08       97      4
2021-04-09       98      4
2021-04-10       99      4

[90 rows x 2 columns]

# Entrada e saída de dados

In [245]:
df1 = pd.read_csv("exemplo.csv", sep=",", decimal=".")
df1

          0         1         2         3
0 -0.394813 -0.694630  0.253393  0.602590
1 -2.134217  1.141381 -0.130142  0.690936
2 -0.223754  0.365133 -0.104233 -0.182788
3  0.108066  0.331332  0.053708 -0.280468
4  0.085290  0.740834 -0.596941  0.243950

In [246]:
df1.to_csv("exemplo2.csv", sep=";", decimal=",")